Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: སྡོམ་ནི། བུ་དང་རི་ཡི་གཅོང་རོང་གླུད། །འཐབ་དང་རྙིས་བཟུང་གོང་མ་སྲེག ། ཕག་དང་མི་རྒོད་ཤ་ཟ་དང་། །དབང་པོའི་མགོ་ནི་ཐ་མ་ཡིན། །
en: 1. The Sons 2. The Crevasse 3. The Ransom 4. The Attack 5. Trapped 6. The Partridge 7. Father, or The Story of Sudarśana 8. The Bandits 9. The Piśācas 10. The Story of Head of Indra

source: བུ་ཞེས་བྱ་བ་ནི།
en: The Sons

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན། བྲམ་ཟེ་ཞིག་གནས་ཏེ།
en: When the Blessed One was in Śrāvastī, there lived a certain brahmin.

source: དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ཏེ། དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: When the time came for him to marry he took a wife, and as they enjoyed themselves and coupled, one day his wife conceived.

source: འོ་མ་དང་ཞོ་དང་མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་སོ། །
en: They reared him on milk, yogurt, butter, ghee, and milk solids.

source: འདོད་པ་རྣམས་ནི་ཚྭ་ཆུ་དང་འདྲ་སྟེ། ཅི་ཙམ་དུ་བསྟེན་པ་དེ་ཙམ་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: Now desires are like salt water—the more you use to slake your thirst, the more you need.

source: དེ་ནས་ཕྱིས་ཀྱང་མཐར་གྱིས་བྲམ་ཟེའི་བུ་གཅིག་ནས་གཉིས་ནས་བདུན་གྱི་བར་དུ་བྱུང་ནས།
en: Over time, the brahmin eventually had one, and then two, and so on, up to seven sons.

source: དེ་རྣམས་རིགས་དང་འཐུན་པར་མིང་བཏགས་ཏེ།
en: They named them according to their clan,

source: འོ་མ་དང་ཞོ་དང་། མར་དང་ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: and raised them on milk, yogurt, butter, ghee, and milk solids.

source: དེ་དག་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་བྲམ་ཟེའི་སྤྱོད་ལམ་དང་། སྤྱོད་པ་དང་། ཨོཾ་ཞེས་བྱ་བ་དང་། བྷོ་ཞེས་བྱ་བ་དང་། གཙང་སྦྲ་དང་། ཆོ་ག་དང་། ཐལ་བ་བླང་བ་དང་། རིལ་བ་ཐོགས་པ་དང་། ངེས་བརྗོད་ཀྱི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་གྱི་རིག་བྱེད་དང་། སྙན་ཚིག་གི་རིག་བྱེད་དང་། སྲིད་སྲུང་གི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་བྱ་བ་དང་། མཆོད་སྦྱིན་བྱེད་དུ་གཞུག་པ་དང་། སྦྱིན་པ་དང་། བླང་བ་དང་། ཁ་ཏོན་བྱ་བ་དང་། ཁ་ཏོན་སློབ་ཏུ་གཞུག་པའི་ཐབས་བསླབས་ནས། ལས་རྣམ་པ་དྲུག་ལ་མཁས་པའི་བྲམ་ཟེར་གྱུར་ཏོ། །
en: As they grew up they studied letters, brahminical customs and conduct, the syllables oṃ and bho , ritual purity, ritual actions , the collection of ashes, holding the ritual vase, the Ṛg Veda , the Yajur Veda , the Sāma Veda , the Atharva Veda , how to perform sacrificial rites, how to lead others in performing sacrificial rites, how to give and receive offerings, recitation, and recitation instruction. Trained in these procedures, they became masters of the six types of brahminical activities.

source: དེ་ནས་ཕྱི་ཞིག་ན་བྲམ་ཟེ་དེས་བུ་དེ་དག་ཐམས་ཅད་ཁྱིམ་ཕུབ་སྟེ།
en: One day the brahmin gave his home to his sons,

source: བྲམ་ཟེ་དེའི་ཁྱིམ་ན་ནོར་ཅི་ཡོད་པ་དེ་དག་ཐམས་ཅད་སོ་སོར་བགོས་ནས་བུ་དེ་དག་ལ་བྱིན་ནོ། །
en: apportioning what wealth was in the house and distributing it among them.

source: དེ་ནས་ཕྱི་ཞིག་ན་བྲམ་ཟེ་དེའི་ཆུང་མ་ཡང་ཤི །བྲམ་ཟེ་དེ་ཡང་རྒས་ཏེ་མིག་གིས་མི་མཐོང་བར་གྱུར་ནས།
en: Then, after the brahmin’s wife died and the brahmin himself had become old and could no longer see,

source: དེས་དེ་རྣམས་ཀྱིས་ཁྱིམ་ནས་བསྐྲད་དེ།
en: they threw him out of the house,

source: དེ་གཞན་དག་གི་ཁྱིམ་དུ་སློང་ཞིང་འཚོ་བར་བྱེད་དོ། །
en: so he frequented others’ houses, and sustained himself by begging.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་། ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པར་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི། ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་བུ་དེ་གདུལ་བའི་དུས་ལ་བབ་པར་དགོངས་ནས།
en: The Blessed One thought, “The time has now come to tame those brahmins.”

source: སྔོ་དྲོ་ཆོས་གོས་དང་ཤམ་ཐབས་གསོལ་ཏེ།
en: In the morning the Blessed One donned his lower garment and Dharma robes,

source: ལྷུང་བཟེད་བསྣམས་ནས། མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་གཤེགས་ཏེ།
en: and, carrying his alms bowl, he went for alms in Śrāvastī.

source: བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པར་གཤེགས་པ་ན། བྲམ་ཟེ་རྒས་ཤིང་འཁོགས་ལ་གཏུགས་པ། ཁར་བ་དང་སྣོད་ཐོགས་ཤིང་གཞན་དག་གི་ཁྱིམ་དུ་སློང་བ་དེ་གཟིགས་སོ། །
en: As the Blessed One was walking through Śrāvastī, he saw a brahmin, aged and infirm, carrying a walking stick and bowl, begging at the houses of others.

source: གཟིགས་ནས་བྲམ་ཟེ་དེ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One spoke to him, saying,

source: བྲམ་ཟེ་རྒས་ཤིང་འཁོགས་ལ་གཏུགས་པ།
en: “Brahmin, you are aged and infirm.

source: ཁྱོད་ཅིའི་ཕྱིར་ཁར་བ་དང་སྣོད་ཐོགས་ཤིང་། གཞན་གྱི་ཁྱིམ་དུ་སློང་ཞིང་འདུག །
en: Why is it you carry a walking stick and bowl, and beg at others’ houses?”

source: བྲམ་ཟེས་གསོལ་པ། ཀྱེ་མ་གཽ་ཏམ་བདག་གི་བུ་བདུན་མཆིས་ཏེ།
en: “Oh, Gautama,” the brahmin replied, “I had seven sons.

source: དེ་རྣམས་བདག་གིས་གསོས་ནས་བསྐྱེད་བསྲིངས་ནས།
en: I made sure they were cared for and raised well,

source: ཐོས་པས་ཀྱང་མཐར་ཕྱིན་པར་བགྱིས་ཏེ་བཞག་ནས།
en: and that their education was complete.

source: མཆིས་བྲང་དང་བཅས་ཏེ་བཙེམས་ཏེ་བདག་གི་ཁྱིམ་ན་ཅི་བདོག་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བདག་གིས་སོ་སོར་བགོས་ཏེ་སྩལ་ན།
en: And after I arranged for their marriages, apportioned among them what wealth was in the house, and gave it to them,

source: དེ་རྣམས་ཀྱིས་བདག་ཁྱིམ་ནས་བསྐྲད་པས་ན།
en: they threw me out of the house.

source: ཁར་བ་དང་སྣོད་ཐོགས་ཤིང་གཞན་དག་གི་ཁྱིམ་དུ་སློང་ཞིང་རྒྱུ་བར་བགྱིད་དོ། །
en: That’s why I carry a walking stick and bowl, and go about begging at others’ houses.”

source: བྲམ་ཟེ་ཁྱོད་ཀྱིས་ང་ལས་ཚིགས་སུ་བཅད་པ་བསླབས་ཏེ།
en: “Brahmin, would you be able to learn some verses from me,

source: ཀུན་ཆུབ་པར་བྱས་ལ། བུ་དེ་རྣམས་འཁོར་གྱི་ནང་ན་འཁོད་པ་ལས་བསྒྲགས་པར་ནུས་སམ།
en: and when you’ve learned them all, to proclaim them to all your sons?”

source: བྲམ་ཟེས་གསོལ་པ། ཀྱེ་མ་གཽ་ཏ་མ་བདག་གིས་རྔོ་ཐོགས་ཞེས་སོ། །
en: “Yes, Gautama, I can do that,” replied the brahmin.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Thereupon the Blessed One spoke these verses to him:

source: གང་དག་བཙས་ནས་དགར་འགྱུར་བ། །
en: “Those at whose birth I was happy,

source: གང་ཕྱིར་ནོར་ནི་ཀུན་བསགས་པ། །
en: For whom I saved up all my wealth,

source: དེ་དག་བདག་གིས་ཚེམས་དང་སྦྱར། །
en: And whose weddings I arranged

source: བདག་ནི་ཁྱིམ་ནས་བསྐྲད་པར་གྱུར། །
en: Have now driven me from home.

source: ནོར་ཟད་པས་ནི་གང་དག་གིས། །བདག་སྤངས་དེ་དག་དེ་ན་མིན། །
en: “While using up my wealth, They cast me out.

source: སྲིན་པོ་བུ་ཡི་ཆ་ལུགས་ཅན། །ཕ་ཕ་ཞེས་བརྗོད་དེ་མི་བརྗིད། །
en: Monsters all, parading as sons— Still I have not forgotten their cries of ‘Papa!’

source: རྟ་རྒན་ཞོ་ཤ་ཟད་པ་བཞིན། །ན་ཚོད་ཡལ་བར་གྱུར་པ་ན།
en: “My youth has faded, Like an old horse who’s lost his strength.

source: གཞོན་ནུ་རྣམས་ཀྱིས་ཕ་རྒན་ཞིག །གཞན་གྱི་ཁྱིམ་དུ་སློང་བར་གྱུར། །
en: An aged father of young men, I beg at other’s houses.

source: རྟེན་ལ་མ་ཕན་བུ་རྣམས་པས། བདག་གི་ཁར་བ་འདི་བདམ་སྟེ། །
en: “Since my sons are no support, I’ve taken up this stick instead.

source: ཁར་བ་འདི་ཡི་ཡོན་ཏན་མཐུས། །བ་ལང་རྡུང་ཞིང་འོང་བ་དང་། །
en: With its help I fend off cattle and move along,

source: སྦྲུལ་དང་ཁྱི་ཟ་ཟློག་པར་བྱེད། །
en: “Warding off the snakes and dogs,

source: མུན་པའི་ནང་ན་མདུན་དུ་འགྲོ། །
en: Walking on in darkness,

source: ཡ་ངའི་གནས་སུ་ཚོད་ཀྱང་རིག །
en: Counting my paces in fear,

source: རྡེག་འཆོས་ན་ཡང་བདག་ལ་རྟོན། །
en: And when I stumble, it’s my sole support.”

source: དེ་ནས་བྲམ་ཟེ་དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ་འདི་དག་ཐོས་ནས། བུ་རྣམས་ཀྱི་འཁོར་དུ་སོང་སྟེ་བརྗོད་ནས།
en: After the brahmin had heard these verses from the Blessed One, he went and related them to his sons.

source: བུ་རྣམས་ཀྱིས་དེ་ཐོས་མ་ཐག་ཏུ་ཕ་ལ་བཟོད་པར་གསོལ་ཏེ།
en: When they heard him, they begged his forgiveness at once

source: སྔ་མཁོ་བཞིན་དུ་ཁྱིམ་གྱི་བདག་པོར་བཞག་གོ། །
en: and made him master of the house again.

source: དེ་ནས་ཕྱི་ཞིག་ན། བྲམ་ཟེ་དེས་བསམས་པ།
en: One day the brahmin thought,

source: བདག་གི་དཔལ་དང་སྐལ་བ་དང་ལྡན་པ་གང་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི། བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དེའི་བཀའ་དྲིན་ཡིན་ན།
en: “Whatever glory and fortune I have is all by the grace of the Blessed Gautama,

source: མ་ལ་བདག་གིས་བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དེ་བཤོས་གསོལ་ལ། རིན་ཐང་ཆེ་བའི་ན་བཟའ་དབུལ་བར་བྱ་གོར་མ་ཆག་སྙམ་ནས།
en: so I will offer the Blessed Gautama food and very costly robes.”

source: བྲམ་ཟེ་དེས་བཅོམ་ལྡན་འདས་སྤྱན་དྲངས་ཏེ།
en: So the brahmin extended an invitation to the Blessed One,

source: བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་དག་གསོལ་ནས།
en: offering him many good, wholesome foods,

source: རིན་ཐང་ཆེ་བའི་ན་བཟའ་ཕུལ་ལོ། །
en: and presenting him with very valuable clothes.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་དེ་དང་བུ་དེ་རྣམས་ལ་དེ་དག་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: Then the Blessed One taught the brahmin and his sons the Dharma particularly suited to them.

source: དེ་ནས་བྲམ་ཟེ་དེ་འཁོར་དང་བཅས་པས། སྟན་དེ་དག་ཉིད་ལ་འཁོད་བཞིན་དུ། འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: When they heard it, the brahmin and his sons destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: བདག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱད་པ་སྤྱོད་པར་འཚལ་ལོ། །
en: In the presence of the Blessed One, we too wish to practice the holy life.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་དེ་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ།
en: With the words “Come, join me, monks!” the Blessed One led them to go forth as novices,

source: དེ་ལ་ལུང་ཡང་ཕོག་སྟེ།
en: and instructed them.

source: དེས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: བཙུན་པ་བྲམ་ཟེ་རྒས་ཤིང་འཁོགས་ལ་གཏུགས་པ་འདི་བུ་རྣམས་ཀྱིས་ཁྱིམ་ནས་བསྐྲད་ནས།
en: “tell us why this brahmin, aged and infirm, was thrown out of his house by his sons,

source: འདི་བཅོམ་ལྡན་འདས་ཀྱིས་ཐབས་དང་ལྡན་པས། སྔ་མཁོའི་གནས་སུ་སླར་སོར་ཆུད་པར་མཛད་ནས།
en: and the Blessed One, possessed of skillful means, restored him to his former condition

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་བྲམ་ཟེ་འདི་བུ་རྣམས་ཀྱིས་རང་གི་ཁྱིམ་ནས་བསྐྲད་པ་ན།
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, this brahmin was thrown out of his house by his sons,

source: འདི་ངས་སྔ་མཁོའི་གནས་སུ་བཞག་ནས། བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་ཇི་ལྟར་གནས་པར་བྱས་པ་དེ་ཉོན་ཅིག །
en: and I restored him to his former condition and established him in the four meditative states and the five superknowledges. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོང་ཁྱེར་ཙམ་པ་ཞེས་བྱ་བ་ན། ཁྱིམ་བདག་ཅིག་གནས་པ་དེ་ལ་སྔ་ཕྱིར་བུ་བདུན་བྱུང་ནས་དེ་དག་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། བརྟག་པ་རྣམ་པ་བརྒྱད་ལ་བྱང་བར་གྱུར་ནས། ཁྱིམ་བདག་དེས་བུ་དེ་དག་ཐམས་ཅད་ཁྱིམ་ཕུབ་སྟེ།
en: “Monks, in times gone by, in the city of Campā there lived a certain householder who over time had seven children. When they had grown and been educated in the eight types of examination, the householder gave his home to his sons,

source: དེའི་ཅི་བདོག་པ་དེ་དག་ཐམས་ཅད་ཀྱང་སོ་སོར་བགོས་ནས། དེ་རྣམས་ལ་བྱིན་ནོ། །
en: apportioning among them all that he possessed and giving it to them.

source: ཁྱིམ་བདག་དེ་ཡང་རྒས་ཤིང་འཁོགས་ལ་གཏུགས་པར་གྱུར་ནས།
en: When the householder had become old and could no longer see,

source: དེ་བུ་དེ་རྣམས་ཀྱིས་ཁྱིམ་ནས་བསྐྲད་དེ།
en: they threw him out of the house,

source: དེ་རྒས་བཞིན་ཟོང་ཁྱེར་ཏེ་ཡུལ་གཞན་དུ་ཆས་སོ། །
en: so he gathered up his few things and went to another country.

source: དེའི་ཚེ་དཀའ་ཐུབ་ཀྱི་གནས་ཞིག་ན། དྲང་སྲོང་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་གནས་ཏེ།
en: “At that time there lived in a place devoted to austerities a certain sage, a person of great miracles and great power.

source: དཀའ་ཐུབ་ཀྱི་གནས་དེའི་འདབ་ཅིག་ཏུ་དེ་འོངས་ནས། དྲང་སྲོང་དེས་ཁྱིམ་བདག་དེ་མཐོང་ནས་སྨྲས་པ།
en: Seeing the householder nearing his place devoted to austerities, the sage said,

source: ཁྱིམ་བདག་རྒས་ཤིང་འཁོགས་ལ་གཏུགས་པ་ཁྱོད་ཅིའི་ཕྱིར་ཡུལ་གཞན་དུ་ཆས་ཏེ་འགྲོ།
en: ‘Householder, you are aged and infirm. Why are you traveling in a foreign land?’

source: དེ་ནས་ཁྱིམ་བདག་དེས་གཏམ་དེ་དྲང་སྲོང་དེ་ལ་རྒྱས་པར་བསྙད་དོ། །
en: “The householder related the story to him in detail,

source: ཁྱིམ་བདག་ཁྱོད་ངས་ཅི་ནས་བུ་དེ་རྣམས་ཀྱིས་མཆོད་པ་དང་རིམ་གྲོ་བྱེད་པར་འགྱུར་བ་དེ་ལྟར་བྱའོ་ཞེས་སྨྲས་ནས།
en: ‘Householder, I shall make it so your children venerate and serve you no matter what.’

source: དྲང་སྲོང་དེས་ཁྱིམ་བདག་དེ་ཕྱིར་ཟློག་སྟེ་རང་གི་གནས་སུ་ཁྲིད་ནས། དྲང་སྲོང་དེས་དེའི་བུ་རྣམས་ལ་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The sage brought the householder back to his own dwelling and taught the householder’s sons the Dharma particularly suited to them,

source: དེས་ན་བུ་དེ་རྣམས་ཀྱིས་ཕ་དེ་ཁྱིམ་དུ་བོས་ནས། སྔ་མཁོ་བཞིན་དུ་བཞག་གོ། །
en: such that the sons welcomed their father back to the house and restored things to the way they were.

source: དེ་ནས་ཁྱིམ་བདག་དེས་སྔ་མའི་དྲིན་ལན་བསབ་པའི་ཕྱིར་དྲང་སྲོང་དེ་ཁྱིམ་དུ་ཟས་བྱིན་ནས། དེའི་ཐད་དུ་རབ་ཏུ་བྱུང་སྟེ།
en: To repay his previous kindness, the householder offered food to the sage and went forth in his presence.

source: དེ་རབ་ཏུ་ཕྱུང་ནས་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: After he had gone forth in his presence, he generated the four meditative states and five superknowledges.

source: དེའི་ཚེ་དྲང་སྲོང་དུ་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: I am the one who was that sage then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་ཁྱིམ་བདག་ཏུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བྲམ་ཟེ་འདི་ཁོ་ན་ཡིན་ནོ། །
en: The one who was that householder then is none other than this brahmin.

source: དེའི་བུར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་བུ་འདི་དག་ཁོ་ན་ཡིན་ཏེ།
en: Those who were his sons then are none other than his sons today.

source: དེའི་ཚེ་ཡང་འདི་རྒས་ཤིང་འཁོགས་ལ་གཏུགས་པར་གྱུར་ནས། ཁྱིམ་ནས་བསྐྲད་པ་ལས་
en: At that time he was aged and infirm, and thrown out of his house, and

source: ངས་ཐབས་དང་ལྡན་པས་སྔ་མཁོའི་གནས་སུ་བཅུག་སྟེ་བཞག་ནས།
en: I, possessed of skillful means, restored him to his former condition

source: བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་གནས་པར་བྱས་སོ།
en: and placed him in the four meditative states and the five superknowledges.

source: ད་ལྟར་ཡང་འདི་རྒས་ཤིང་འཁོགས་ལ་གཏུགས་པར་གྱུར་ནས། ཁྱིམ་ནས་བསྐྲད་པ་ལས་
en: Now as well he is aged and infirm and has been thrown out of his house, and

source: དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས།
en: After practicing pure conduct all his life then,

source: དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ན། ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: his faculties ripened, and now he has been liberated.”

source: རི་ཞེས་བྱ་བ་ནི།
en: The Crevasse

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་དེས།
en: When the Blessed One was in Śrāvastī, there lived a certain householder.

source: ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས།
en: When the time came for him to marry, he took a wife,

source: རིགས་དང་འཐུན་པར་མིང་བཏགས་ནས།
en: they named him according to their clan.

source: དེ་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: They reared him on milk, yogurt, butter, ghee, and milk solids.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་། ཁོང་རྩིས་དང་། ཤོད་དགོད་པ་དང་། ལག་རྩིས་དང་། དབྱུང་བ་དང་། སྦ་བ་དང་། དགྲམ་པ་དང་། གོས་བརྟག་པ་དང་། ནོར་བུ་བརྟག་པ་དང་། རིན་པོ་ཆེ་བརྟག་པ་དང་། སྤོས་བརྟག་པ་དང་། སྨན་བརྟག་པ་དང་། གླང་པོ་ཆེ་བརྟག་པ་དང་། རྟ་བརྟག་པ་དང་། གོ་མཚོན་བརྟག་པ་ལ་བསླབས་ཏེ།
en: As he grew up, he studied letters, tallying, and arithmetic; the study of seals, lending, deposits, and commerce; and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་ཕས་མཛའ་སྡེ་རྣམས་ཀྱི་ནང་དུ་བཏང་ངོ་། །
en: One day his father had him join social club.

source: མཛའ་སྡེ་བོ་དེ་རྣམས་ནི་ལྟ་བ་དང་། འདོད་པ་ཐ་དད་པ་ཕན་ཚུན་མི་འཐུན་པར་སྨྲ་བ་ཤ་སྟག་སྟེ།
en: The members of this social club would argue among themselves about different views and theories,

source: གང་དག་གང་ལ་དགའ་བ་དེ་དག་དེའི་བསྔགས་པ་རྗོད་པར་བྱེད་དོ། །
en: and when they agreed with what someone said they would commend him.

source: ཁྱིམ་བདག་གི་བུ་དེ་ནི་རང་བཞིན་གྱིས་མཛངས་པ་ཞིག་སྟེ།
en: The householder’s son was naturally astute.

source: ཐམས་ཅད་ཀྱི་གཞུང་ལུགས་འདྲི་བར་བྱེད་ན། ལ་ལ་ཅི་ཟེར།
en: When he questioned everyone’s philosophical systems, some would answer him.

source: ལ་ལ་ཅི་ཟེར་བར་གྱུར་ནས། ལྟ་བའི་རྣམ་པ་དེ་དག་མི་འདོད་ཅིང་། མི་བཟོད་ལ་རུང་བར་མི་འཛིན་ཏོ། །
en: But when they answered, he didn’t accept their various views and considered them untenable and incorrect.

source: དེ་ནས་ཕྱི་ཞིག་ན་དགེ་བསྙེན་ཞིག་གིས་སངས་རྒྱས་ཀྱི་བསྔགས་པ་ཡང་དག་པ་ཅི་ལྟ་བ་བཞིན་དུ་བརྗོད་ནས།
en: One day a lay vow holder spoke correctly in praise of the Buddha, and

source: དེ་ཐོས་མ་ཐག་ཏུ་ཁྱིམ་བདག་གི་བུ་དེས་དྲིས་པ།
en: as soon as the householder’s son heard this, he said,

source: སངས་རྒྱས་ཞེས་བྱ་བའི་སྒྲ་བྱུང་བ་འདི་དག་ནི་སྔོན་མ་བྱུང་ན་
en: “I’ve never heard the term buddha before.

source: སངས་རྒྱས་ཞེས་བྱ་བ་དེ་སུ་ཞིག །
en: Who is this one you call Buddha?”

source: དེ་ནས་དགེ་བསྙེན་དེས་དེ་དང་འཐུན་པའི་སངས་རྒྱས་ཀྱི་བསྔགས་པ་བརྗོད་དོ། །
en: Then the lay vow holder praised the Buddha in a way that particularly appealed to the householder’s son,

source: དེ་ནས་ཁྱིམ་བདག་གི་བུ་དེ་བཅོམ་ལྡན་འདས་བལྟ་བར་འདོད་པར་གྱུར་ཏོ། །
en: causing him to feel a strong desire to see the Blessed One.

source: དེ་ནས་དེས་ཐམས་ཅད་བོར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: He left everything behind and went to see the Blessed One,

source: ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: and when he arrived he touched his head to the Blessed One’s feet and

source: དེ་ཐོས་ནས་ཁྱིམ་བདག་གི་བུ་དེ་བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བར་གྱུར་ཏོ། །
en: and when he heard it the householder’s son felt joy toward the Blessed One.

source: དེ་ནས་ཁྱིམ་བདག་གི་བུ་དེས་བཅོམ་ལྡན་འདས་ཀྱི་གཏམ་མཇུག་རྫོགས་པར་རིག་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་ཅིང་རྗེས་སུ་ཡི་རངས་ཏེ།
en: Then the householder’s son, knowing the Blessed One had completed his discourse, rejoiced, praised all that the Blessed One had said,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: touched his head to the Blessed One’s feet, and took leave of him.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་སྦྱིན་པ་གཏོང་བའི་སེམས་སྐྱེས་ལ། ཁྱིམ་ན་ནི་ཅི་ཡང་མི་བདོག་པར་མཐོང་ནས།
en: One day he was of a mind to give gifts, but he saw there were no possessions at all in his house.

source: དེའི་བློ་སྐྱེས་པ། བདག་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་སོང་ལ།
en: The idea came to him to set out on the great ocean.

source: གལ་ཏེ་བདག་གི་ལན་ཅིག་ཙམ་རིན་པོ་ཆེའི་གླིང་བགྲོད་པ་བསྒྲུབ་ནུས་པར་གྱུར་ན་ཡང་། དེ་ལྟར་ན་བདེ་བླག་ཏུ་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་ཀྱང་བྱེད་ནུས་སོ་སྙམ་ནས
en: “If I can complete just one crossing to Ratnadvīpa, it will be easy for me to give gifts and make merit,” he thought,

source: ཚོང་པ་ལྔ་བརྒྱ་ཙམ་དང་ལྷན་ཅིག་ཏུ་ཟོང་ཁྱེར་ཏེ། རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་སོང་ནས།
en: so he loaded up his wares and set out on the great ocean in the company of some five hundred merchants.

source: དེས་རིན་པོ་ཆེའི་གླིང་བགྲོད་པ་བསྒྲུབས་ཏེ། ཕྱིར་འཛམ་བུའི་གླིང་ལོགས་སུ་ཆས་པ་ལས། དེ་དག་རླུང་མི་བཟོད་པ་བྱུང་ནས།
en: After he completed his crossing to Ratnadvīpa and was returning to Jambudvīpa, an overpowering gale arose and

source: དེས་གྲུ་བོ་ཆེ་དེ་རིའི་གཅོང་རོང་ཞིག་ཏུ་བཙངས་སོ། །
en: thrust their great seafaring vessel into a crevasse.

source: དེ་ནས་རྒྱ་མཚོའི་དུས་རླབས་ཕྱིར་ལོག་པ་དང་། ཚོང་པ་དེ་དག་འཇིགས་ཤིང་སྐྲག་སྟེ།
en: As the tides of the great ocean returned, all of the merchants became terrified and cried out,

source: བདག་ཅག་ནི་ཤི་ཟིན་ནོ། །
en: “We’re as good as dead!

source: བདག་ཅག་གི་སྲོག་ནི་མེད་ཟིན་ནོ། །
en: Our lives are over.

source: ད་བདག་ཅག་ལ་དགའ་བ་བྱེད་པ་དང་།
en: Who can console us?

source: སྲོག་ཕངས་པ་སྦྱིན་པ་སུ་ཡོད་ཅེས་འཛེར་ཏོ། །
en: Who can save our precious lives?”

source: དེ་ནས་དེད་དཔོན་གྱིས་སྨྲས་པ། མ་འཇིགས་ཤིག་མ་འཇིགས་ཤིག །
en: “Have no fear, have no fear,” said the captain.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་དེང་ཤིག་དང་།
en: “Take refuge in the Blessed Buddha.

source: དེས་བདག་ཅག་ཕོངས་པ་དང་། དཀོས་ཐག་པ་དང་གནོད་པ་དང་ཕྲད་པ་ལས་སྐྱབས་མཛད་པར་འགྱུར་རོ་ཞེས་བྱས་སོ། །
en: He will grant us refuge from meeting with misfortune, suffering, and harm.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཚོང་པ་དེ་རྣམས་སངས་རྒྱས་ལ་སྐྱབས་སུ་སོང་སྟེ།
en: No sooner had the merchants heard this than they all took refuge in the Buddha, saying,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ནི་འདི་ལྟ་སྟེ། འདས་པ་དང་། མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བ་ཅི་ཡང་མི་གཟིགས་པ་དང་། མི་མཁྱེན་པ་དང་། ཐུགས་སུ་མ་ཆུད་པ་མ་མཆིས་ན།
en: “Lord, Blessed One, if there is nothing past, present, or future that you do not see, know, or directly perceive, then heed us now,

source: ཀྱེ་མ་བཙུན་པ་བདག་ཅག་ཕོངས་ཤིང་དཀོས་ཐག་ལ་གནོད་པ་དང་ཕྲད་པ་རྣམས་ལ་སྐྱབས་མཛད་དུ་གསོལ།
en: Lord, grant us refuge from meeting with misfortune, suffering, and harm!

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་གྲུ་དེ་རང་ཉིད་རིའི་གཅོང་རོང་དེ་ནས་ཕྱིར་ལོག་སྟེ། རྒྱ་མཚོའི་འགྲམ་དུ་འབྱུང་བར་འགྱུར་བ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་སོ། །
en: At this the Blessed One performed a miracle that caused the boat to return back from the crevasse to shore of its own accord.

source: དེ་ནས་དེ་དག་རྒྱ་མཚོ་ཆེན་པོའི་འགྲམ་དུ་བྱུང་ནས། མཐར་གྱིས་མཉན་དུ་ཡོད་པར་སོང་སྟེ། མཉན་དུ་ཡོད་པར་རྫས་རྣམས་བཞག་ནས།
en: After the merchants had returned to shore, they eventually made their way to Śrāvastī, where they unloaded their wares.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་འོ་བྱས་ནས། འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: They touched their heads to the Blessed One’s feet, kissed them, and said,

source: བཅོམ་ལྡན་འདས་ནི་བདག་ཅག་ལ་དཀའ་བ་མཛད་མཛད་པ་ལགས།
en: “Look at the difficult task the Blessed One has done for us!

source: དེ་ནས་དེད་དཔོན་ལ་སོགས་པ་ཚོང་པ་ལྔ་བརྒྱ་པོ་རྣམས་ཀྱིས་སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ། འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Hearing it, the captain and the rest of the five hundred merchants destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེ་རྣམས་ཀྱིས་བདེན་པ་མཐོང་ནས། གསོལ་པ།
en: Having seen the truths, they rose from their seats, drew down the right shoulder of their upper garments, bowed toward the Blessed One with palms pressed together, and requested the Blessed One,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་མཛད་ནས། དེ་དག་ལ་ལུང་ཡང་ཕོག་ནས།
en: With the words “Come, join me, monks!” the Blessed One led them to go forth as novices, conferred on them full ordination, and instructed them.

source: དེ་དག་གིས་ཀྱང་བརྩོན་པ་དང་། བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: They cast away all afflictive emotions through diligence, practice, and effort, and manifested arhatship.

source: ཙན་དན་སྤངས་པ་ལྟ་བུར་བསིལ་བར་གྱུར་པ།
en: They became cool like wet sandalwood.
